# 'brew tap'
tap "homebrew/bundle"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Installing Docker
cask "docker"

brew "whalebrew" # Whalebrew
brew "mas" # Appstore CLI
brew "stow" # Stow for syncing dotfiles

# Installing core commands
brew "xz"
brew "ack"
brew "git"
brew "grep"
brew "gnutls"
brew "gnupg"
brew "git-lfs"
brew "screen"
brew "exiftool"
brew "exiv2"
brew "tree"
brew "findutils"
brew "coreutils"
brew "moreutils"
brew "foremost"
brew "netcat"
brew "wget"
brew "curl"
brew "nmap"

cask "arc" # Arc Browser
cask "1password" # 1Password
cask "grandperspective" # GrandPerspective

# Productivity
cask "morgen" # Calendar, tasks and scheduler
cask "notion"

# Microsoft Office
cask "microsoft-auto-update"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694

cask "postman" # Postman
cask "intellij-idea"
cask "android-studio"
brew "kotlin"
brew "kdoctor"
brew "swiftlint"
brew "cocoapods"
brew "cmake"
brew "nvm"
brew "openjdk@17"
brew "go"
brew "python@3.11"
mas "Xcode", id: 497799835

# Visual Studio Code
cask "visual-studio-code" 
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"